import React from 'react'
const renew = {
    'xy0407': ['更新传感器线序', '修改旋转矩阵bug', '添加矩阵复位', '优化回放问题', '优化取消框选', '优化图表显示'],
    'xy0410': ['增加红点显示'],
    'XY0510 beta1.0': ['修改气囊充放气'],
    'XY0516': ['更新气囊充气算法'],
    'XY0601': ['除8硬件加老分压'],
    'XY06016': ['除6硬件加老分压'],
    'JQ0603': ['新增车载座椅出图'],
    'XY0603': ['添加实时睡姿判断'],
    'JQ0604': ['无更新,只显示jqbed'],
    'CAR0611': ['更新颜色', '分压', '3D修复', '置零'],
    'CAR0614': ['volvo头部置零'],
    'CAR0616': ['国际化补全', '将清零功能与下载数据同步', '添加头枕数据回放和下载'],
    'SHOW0616': ['修复foot bug', '添加手部传感器注释的串线'],
    'JQ0621end': ['新增终端小床垫睡姿采集'],
    'JQ0625': ['出手线序更改为小床线序'],
    'JQ829': ['exe更新出手线序,软件加密'],
    'JQ912': ['node exe车载传感器位置顺序', '调整原始数据线序'],
    'JQ919': ['exe修改密钥有效期网络时间',],
    'JQ920': ['添加热力图 2D',],
    'JQ-BED-240929': ['添加面积为传感器点数乘8 单位cm2'],
    'JQ-HAND-241007': ['新增出手传感器'],
    'JQ-HAND-241018': ['将在线时间戳变为本地服务器'],
    'JQ-BED-241104': ['去掉分压算法'],
    'JQTOOLS-241128': ['更新密钥类型为传感器类型加上时间', '添加臀部监测传感器类型(臀部监测分压算法)', '优化床垫类型初始值'],
    'JQTOOLS-250110': ['新增手套传感器', '席悦传感器取消分压'],
    'JQTOOLS-LRhand': ['新增左右手传感器',],
    '0609_4096' : ['4096版本'],
    '0612Car': ['恩迪汽车',],
    '0703QX': ['清闲座椅',],
    '0718QX': ['清闲座椅',],
    '0728_100': ['100HZ256',],
    '0805' : ['眼罩'],
    "26_1_20" : ['修改压力保留两位小数'],
    "26_1_20_1" : ['添加大裂谷14*20高速'],
    "26_2_5" : ['16*16高速、32*32高速添加放大功能'],
}
export default function Log() {
    return (
        <div style={{ padding: '30px' }}>
            {Object.keys(renew).reverse().map((a, index) => {
                console.log(renew[a])
                return (
                    <>
                        <h2>{a}</h2>
                        <ul>
                            {
                                renew[a].map((b, bindex) => {
                                    console.log(b)
                                    // (<li>{b}</li>)
                                    return (
                                        <li>{b}</li>
                                    )
                                })
                            }
                        </ul>
                    </>
                )
            })}
        </div>
    )
}
